#define h1"帮助、关于、说明"
#define h2"上、下"
#define h3"左、右(6)键"
#define h4"按数字键快截！"
#define h5"无所谓、忧乐 作品"
#define h6"鄙视盗版、支持正版。"
#define h7"忧乐宫格应用v1.0"


void help()
{
int x;
cls(0,0,0);
for(x=240;x>=0;x-=10)
{
drect(0,0,240,320,2,255,2);
drect(2,2,236,316,0,0,0);

dtext("<==",x-30,150,x,x,x,0,1);
dline(x,0,x,320,x,rand()%256,x);

dtext(h1,x,5,255,255,0,0,1);
dtext(h2,x,45,255,255,255,0,1);
dtext(h3,x,85,0,255,0,0,1);
dtext(h4,x,125,255,0,255,0,1);
dtext(h5,x,165,0,0,255,0,1);
dtext(h6,x+1,206,255,0,255,0,1);
dtext(h6,x,205,255,5,5,0,1);
dtext(h7,x,245,200,99,99,0,1);ref(0,0,240,320);
}
for(x=45;x<=320;x+=40)
dline(0,x-5,240,x-5,x,x+100,x-10);


dtext("返回",180,285,255,255,255,0,1);
dtext("返回",182,287,2,255,2,0,1);
ref(0,0,240,320);
}