void re()
{ref(0,0,240,320);}

void y1()
{int x,y;

//绘背景
drect(0,0,240,320,255,255,255);
drect(2,2,235,315,0,0,0);

for(y=0;y<=30;y++)
{dline(0,y,y,0,y*20,y+100,rand()%256);

dline(0,320-y,y,320,240-y,y+100,rand()%256);

dline(y,320,240,320-y,y*20,y+100,y);

}
for(y=0;y<320;y+=30)
dline(0,y,240,y,y,rand()%256,y*3);


//百页效果
for(y=0;y<=30;y++)
{sleep(99);
for(x=0;x<=11;x++)
ref(0,y+x*30,240,1);
}

sleep(1000);

//绘花
char p[2];
for(x=0;x<=20;x++)
{
if(x%3==0)
sprintf(p,"*");
else if(x%2==0)
sprintf(p,"*");
else sprintf(p,"*");

dtext(p,rand()%256,rand()%256,rand()%256,rand()%256,rand()%256,0,1);re();
}

//绘文字，x为每次刷新x坐标，y为纵坐标
for(y=0;y<=390;y+=30)
for(x=0;x<240;x+=10)
{
dtext("珍惜现在",70,5,x,y,x+y,0,1);
dtext("人的一生很短暂，",0,35,x,y,y-x,0,1);
dtext("不能白白就这样浪费。",0,65,x,x,x,0,1);
dtext("我们应该珍惜每分每秒，",0,95,y,x,y,0,1);
dtext("做自己喜欢的事，",0,130,x,y,x,0,1);
dtext("不要认为自己没用！",0,160,x,y,y,0,1);
dtext("只是你自己不努力而已",0,190,y,y,x,0,1);
dtext("天才不是生来就有的！",0,215,y,x,y+x,0,1);
dtext("那是他们的无尽的汗水，",0,245,y,x+x,y+x,0,1);
dtext("换来的！！！",0,275,y+x,x,y,0,1);

ref(x,y,25,30);



if(y>=330)
{x=rand()%256;
if(x==230)x=255;
re();}

}

re();
sleep(3520);

//马赛克效果
for(x=1;x<150;x++)
{
drect(rand()%256,rand()%256,30,30,0,0,0);
dtext("成为碎片",100,130,255,180,180,0,1);
re();

}

y=0;
//整理画面
for(x=0;x<=240;x+=3)
{
y+=4;
drect(240-x,320-y,x,y,0,0,0);
dtext("整理画面",240-x,320-y,x,y,x+y,0,1);
re();
}

jm=1;
yl();
}