#ifndef MRC_PORT_NET_WIFI_H
#define MRC_PORT_NET_WIFI_H

#include "mrc_base.h"
#include "mrc_exb.h"

/**********************************************************************************
   是否支持wifi
   如果wifi处于关闭的状态的话，也是返回MR_FAILED
   输入:
   返回:
   MR_SUCCESS    支持wifi
   MR_FAILED    不支持wifi或者处于关闭状态
   MR_IGNORE    接口不支持
**********************************************************************************/

int32 mrc_checkWifiSupport(void);


/**********************************************************************************
   使用wifi进行网络连接
   输入:
   返回:
   MR_FAILED     失败
   MR_SUCCESS    成功
   MR_IGNORE    接口不支持
**********************************************************************************/

int32  mrc_useWifiNet(void);

/**********************************************************************************
   使用gprs进行网络连接
   输入:
   返回:
   MR_FAILED     失败
   MR_SUCCESS    成功
   MR_IGNORE    接口不支持
**********************************************************************************/

int32  mrc_useGprsNet(void);

#endif